class ShayariModel {
  String? type;
  String? shayari;
  ShayariModel({
    required this.type,
    required this.shayari,
  });
}

List<ShayariModel> shayariList = [
  ShayariModel(
      type: "love",
      shayari: "तू हज़ार बार भी रूठे तो मना लूँगा तुझे \n" +
          "मगर देख मोहब्बत में शामिल कोई दूसरा ना हो"),
  ShayariModel(
      type: "love",
      shayari: "किस्मत यह मेरा इम्तेहान ले रही है \n" +
          "तड़पकर यह मुझे दर्द दे रही है\n" +
          "दिल से कभी भी मैंने उसे दूर नहीं किया\n" +
          "फिर क्यों बेवफाई का वह इलज़ाम दे रही है"),
  ShayariModel(
      type: "love",
      shayari: "मरे तो लाखों होंगे तुझपर\n" + "मैं तो तेरे साथ जीना चाहता हूँ"),
  ShayariModel(
      type: "love",
      shayari: "वापस लौट आया है हवाओं का रुख मोड़ने वाला\n" +
          "दिल में फिर उतर रहा है दिल तोड़ने वाला"),
  ShayariModel(
      type: "love",
      shayari: "अपनों के बीच बेगाने हो गए हैं\n" +
          "प्यार के लम्हे अनजाने हो गए हैं\n" +
          "जहाँ पर फूल खिलते थे कभी\n" +
          "आज वहां पर वीरान हो गए हैं"),
  ShayariModel(
      type: "love",
      shayari: "जो शख्स तेरे तसव्वुर से हे महक जाये\n" +
          "सोचो तुम्हारे दीदार में उसका क्या होगा"),
  ShayariModel(
      type: "love",
      shayari: "मोहब्बत का एहसास तो हम दोनों को हुआ था\n" +
          "फर्क सिर्फ इतना था की उसने किया था और मुझे हुआ था"),
  ShayariModel(
      type: "love",
      shayari: "सांसों की डोर छूटती जा रही है\n" +
          "किस्मत भी हमे दर्द देती जा रही है\n" +
          "मौत की तरफ हैं कदम हमारे\n" +
          "मोहब्बत भी हम से छूटती जा रही है"),
  ShayariModel(
      type: "love",
      shayari: "समझता ही नहीं वो मेरे अलफ़ाज़ की गहराई\n" +
          "मैंने हर लफ्ज़ कह दिया जिसे मोहब्बत कहते है"),
  ShayariModel(
      type: "love",
      shayari: "समंदर न सही पर एक नदी तो होनी चाहिए\n" +
          "तेरे शहर में ज़िन्दगी कही तो होनी चाहिए"),
  ShayariModel(
      type: "love",
      shayari: "नज़रों से देखो तोह आबाद हम हैं\n" +
          "दिल से देखो तोह बर्बाद हम हैं\n" +
          "जीवन का हर लम्हा दर्द से भर गया\n" +
          "फिर कैसे कह दें आज़ाद हम हैं"),
  ShayariModel(
      type: "love",
      shayari: "मुझे नहीं मालूम वो पहली बार कब अच्छा लगा\n" +
          "मगर उसके बाद कभी बुरा भी नहीं"),
  ShayariModel(
      type: "love",
      shayari: "सच्ची मोहब्बत कभी खत्म नहीं होती\n" +
          "वक़्त के साथ खामोश हो जाती है"),
  ShayariModel(
      type: "love",
      shayari: "ज़िन्दगी के सफ़र में आपका सहारा चाहिए\n" +
          "आपके चरणों का बस आसरा चाहिए\n" +
          "हर मुश्किलों का हँसते हुए सामना करेंगे\n" +
          "बस ठाकुर जी आपका एक इशारा चाहिए"),
  ShayariModel(
      type: "love",
      shayari: "जिस दिल में बसा था नाम तेरा हमने वो तोड़ दिया\n" +
          "न होने दिया तुझे बदनाम बस तेरे नाम लेना छोड़ दिया"),
  ShayariModel(
      type: "love",
      shayari: "प्यार वो नहीं जो हासिल करने के लिए कुछ भी करव दे\n" +
          "प्यार वो है जो उसकी खुशी के लिए अपने अरमान चोर दे"),
  ShayariModel(
      type: "love",
      shayari: "आशिक के नाम से सभी जानते हैं\n" +
          "इतना बदनाम हो गए हम मयखाने में\n" +
          "जब भी तेरी याद आती है बेदर्द मुझे\n" +
          "तोह पीते हैं हम दर्द पैमाने में"),
  ShayariModel(
      type: "love",
      shayari: "हम इश्क़ के वो मुकाम पर खड़े है\n" +
          "जहाँ दिल किसी और को चाहे तो गुन्हा लगता है"),
  ShayariModel(
      type: "love",
      shayari: "गिलास पर गिलास बहुत टूट रहे हैं\n" +
          "खुसी के प्याले दर्द से भर रहे हैं\n" +
          "मशालों की तरह दिल जल रहे हैं\n" +
          "जैसे ज़िन्दगी में बदकिस्मती से मिल रहे हैं"),
  ShayariModel(
      type: "love",
      shayari: "सिर्फ वक़्त गुजरना हो तो किसी और को अपना बना लेना\n" +
          "हम दोस्ती भी करते है तो प्यार की तरह"),
  ShayariModel(
      type: "love",
      shayari: "जरूरी नहीं इश्क़ में बनहूँ के सहारे ही मिले\n" +
          "किसी को जी भर के महसूस करना भी मोहब्बत है"),
  ShayariModel(
      type: "love",
      shayari: "नशे में भी तेरा नाम लब पर आता है\n" +
          "चलते हुए मेरे पाँव लड़खड़ाते हैं\n" +
          "दर्द सा दिल में उठता है मेरे\n" +
          "हसीं चेहरे पर भी दाग नजर आता है"),
  ShayariModel(
      type: "love",
      shayari: "हमने भी एक ऐसे शख्स को चाहा\n" +
          "जिसको भुला न सके और वो किस्मत मैं भी नहीं"),
  ShayariModel(
      type: "romantic",
      shayari: "गलतफहमी की गुंजाईश नहीं सच्ची मोहब्बत में\n" +
          "जहाँ किरदार हल्का हो कहानी डूब जाती है"),
  ShayariModel(
      type: "romantic",
      shayari: "होने दो मुख़ातिब मुझे आज इन होंटो से अब्बास\n" +
          "बात न तो ये समझ रहे है पर गुफ़्तगू जारी है"),
  ShayariModel(
      type: "romantic",
      shayari: "उदासियाँ इश्क़ की पहचान है\n" +
          "मुस्कुरा दिए तो इश्क़ बुरा मान जायेगा"),
  ShayariModel(
      type: "romantic",
      shayari: "कुछ इस अदा से हाल सुनाना हमारे दिल\n" +
          "वो खुद ही कह दे किदी भूल जाना बुरी बात है"),
  ShayariModel(
      type: "romantic",
      shayari: "माना की उससे बिछड़कर हम उमर भर रोते रहे\n" +
          "पर मेरे मार जाने के बाद उमर भर रोएगा वो"),
  ShayariModel(
      type: "romantic",
      shayari: "दिल में तुम्हारी अपनी कभी चोर जायेंगे\n" +
          "आँखों में इंतज़ार की लकीर छोड़ जायेंगे"),
  ShayariModel(
      type: "romantic",
      shayari: "किसी मासूम लम्हे मैं किसी मासूम चेहरे से\n" +
          "मोहब्बत की नहीं जाती मोहब्बत हो जाती है"),
  ShayariModel(
      type: "romantic",
      shayari:
          "करीब आओ तो शायद हम समझ लोगे\n" + "ये दूरिया तो केवल फसले बढ़ती है"),
  ShayariModel(
      type: "friend",
      shayari: "ख्वाहिशो का मोहल्ला बहुत बड़ा होता है\n" +
          "बेहतर है हम जरूरतो की गली में मुड़ जाये"),
  ShayariModel(
      type: "friend",
      shayari: "मुझे परवाह नहीं दुनिया खफा रहे\n" +
          "बस इतनी सी दुआ है, दोस्त मेहरबां रहे"),
  ShayariModel(
      type: "friend",
      shayari: "वक़्त की यारी तो हर कोई करता है ऐ मेरे दोस्तों\n" +
          "में तो तब आता है जब वक़्त बदल जाये पर यार ना बदले"),
  ShayariModel(
      type: "friend",
      shayari:
          "हर नई चीज अच्छी होती है,लेकिन\n" + "दोस्त पुराने ही अच्छे होते हैं"),
  ShayariModel(
      type: "friend",
      shayari: "ऐ दोस्त अब क्या लिखूं तेरी तारीफ में\n" +
          "बड़ा खश है तू मेरी ज़िन्दगी में"),
  ShayariModel(
      type: "friend",
      shayari: "दोस्तो से दोस्ती रखा करो तबियत मस्त रहेगी\n" +
          "ये वो हक़ीम हैं जो अल्फ़ाज़ सेदुरुस्त किया करते हैं"),
  ShayariModel(
      type: "friend",
      shayari: "गुनगुनाना तो तकदीर में लिखा के लाये थे\n" +
          "खिलखिलाना दोस्तों से तोहफे में मिल गया"),
  ShayariModel(
      type: "friend",
      shayari: "एक ताबीज़.. हमारी गहरी दोस्ती को चाहिए\n" +
          "जरा सी दिखी नहीं कि नज़र लगने लगती हैं"),
  ShayariModel(
      type: "friend",
      shayari: "सियाह रात में जलते है जुगनू की तरह\n" +
          "दिलों के ज़ख्म भी दोस्तों कमाल होते है"),
  ShayariModel(
      type: "friend",
      shayari: "जिसकी शाम अच्छी उसकी रात अच्छी\n" +
          "जिसके दोस्त अच्छे उसकी ज़िंदगी अच्छी"),
  ShayariModel(
      type: "friend",
      shayari: "बच के रहना ऐसे लोगों से ऐ मेरे दोस्त\n" +
          "जिसके दिल में भी एक दिमाग रहता है"),
];
